projects/app/Http/Controllers/EmployeeController.php

select `id`, `title`, `publish` from `deals` where `publish` = 'published'
select `id`, `title`, `publish`, `category_id` from `questions` where `publish` = 'published'
select `question_id` from `votes` where `votes`.`question_id` in (1, 2, 3, 4, 5, 6, 7, 8) and `user_id` = 15
select `id`, `title`, `publish`, `category_id` from `questions` where `publish` = 'published' and exists (select * from `votes` where `questions`.`id` = `votes`.`question_id` and `user_id` = 15)
---
    public function index(Request $request)
    {
        $CategoryId = '';
        if (isset($request->category_id) && $request->category_id != '') {
            $CategoryId = base64_decode($request->category_id);
        }

        $data = new \stdClass();
        $data->title = "User Dashboard ";
        $data->meta_title = "User Dashboard";
        $data->meta_keywords = "User Dashboard";
        $data->meta_description = "User Dashboard";
        $user = Auth::guard('employee')->user();
        $questionCategory = Deal::where('publish', 'published')
            ->select('id', 'title', 'publish')
            ->get();

        $questions = Question::where('publish', 'published')
            ->when($CategoryId, function ($query, $CategoryId) {
                return $query->where('category_id', $CategoryId);
            })
            ->with(['votes' => function ($query) use ($user) {
                $query->where('user_id', $user->id)
                    ->select('question_id'); // add columns you want
            }])
            ->select('id', 'title', 'publish', 'category_id')
            ->get();


            $vodetQuestions = Question::where('publish', 'published')
              ->whereHas('votes', function ($query) use ($user) {
               $query->where('user_id', $user->id);
                })
                ->select('id', 'title', 'publish', 'category_id')
                ->get();