projects/app/Http/Controllers/PageController.php

    function blogSingle($seo_url)
    {
        $data = Blog::where("publish", "published")->where("seo_url", $seo_url)->first();
        if ($data) {
            $category = BlogCategory::find($data->blog_category_id);
---
select * from `blogs` where `publish` = 'published' and `seo_url` = 'lorem-ipsum-is-simply-dummy-text-and-typesetting-industry' limit 1
select * from `blog_categories` where `blog_categories`.`id` = '7' limit 1

    public function index(Request $request)
    {


        $data = Cms::where("seo_url", 'home')->first();
        $BreakingNews = NewsPost::where('breaking_news', 'yes')->where('publish', 'published')->orderBy('id', 'desc')->limit(10)->select('id', 'name', 'seo_url', 'bannerImage')->get();
---
select `id`, `name`, `seo_url`, `bannerImage` from `news_post` where `breaking_news` = 'yes' and `publish` = 'published' order by `id` desc limit 10

    public function dynamicDataCategory(Request $request, $seo_url)
    {

        if ($seo_url == "home") {
            return redirect("/");
            //  return redirect()->route('front-home');
        }
        if ($seo_url == "customer-login") {
            if (\Illuminate\Support\Facades\Auth::guard('employee')->check()) {
                return redirect('/');
            }
        }

        // if(Auth::guard('employee')->check()){
        //     return redirect("user/dashboard");
        // }
        if ($seo_url == "user-login" || $seo_url == "user-register" || $seo_url == "forgot-password") {
            if (\Illuminate\Support\Facades\Auth::guard('employee')->check()) {
                return redirect('user/dashboard');
            }
        }

        $data = Cms::where("seo_url", $seo_url)->first();


        if ($data) {
            $templete = "front.static." . $data->templete;
            if ($data->templete == "blogs") {
                $blogs = Blog::where("publish", "published")->orderBy("id", "desc")->paginate(12);
---
select * from `blogs` where `publish` = 'published' order by `id` desc limit 12 offset 0
select count(*) as aggregate from `blogs` where `publish` = 'published'

            return view($templete, compact("data"));
        }

        $data = BlogCategory::where("seo_url", $seo_url)->first();

        if ($data) {
            $blogs = Blog::where("blog_category_id", $data->id)->where('publish', 'published')->orderBy("id", "desc")->paginate(12);
---
select * from `blog_categories` where `seo_url` = 'motor-insurance' limit 1
select * from `blogs` where `blog_category_id` = 7 and `publish` = 'published' order by `id` desc limit 12 offset 0
select count(*) as aggregate from `blogs` where `blog_category_id` = 7 and `publish` = 'published'

        $data = Cms::where("seo_url", 'policy-detail')->first();

        if ($data) {
            $insurance = Service::where("seo_url", $seo_url)->first();
---
select * from `services` where `seo_url` = 'motor-insurance' limit 1