projects/app/Helper/ModelHelper.php

    function getCareerLocationSelect(){
        $data=[];
        $all=Deal::where('publish','published')->get();
---
select * from `deals` where `publish` = 'published'

	public function getDataFromSetting($name){
		$result=null;
		$data=BasicSetting::where("name",$name)->first();
---
select * from `basic_settings` where `name` = 'favicon' limit 1